SiliconLabs/arduino/boards.txt
xg24devkit.menu.protocol_stack.ble.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble/include"

xg24devkit.menu.protocol_stack.none.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/noradio/include"

xg24devkit.menu.protocol_stack.matter.build.include_list="-I{build.variant.path}/matter" "-I{build.variant.path}/matter/autogen/zap-generated" "-I{build.variant.path}/matter/autogen/zap-generated/app" "-I{build.variant.path}/matter/config" "-I{build.variant.path}/matter/config/btconf" "-I{build.variant.path}/matter/config/common" "-I{build.variant.path}/matter/autogen" "-I{build.variant.path}/matter/include" "-I{build.matter_sdk_path}/examples/lighting-app/silabs/include" "-I{build.matter_sdk_path}/examples/platform/silabs" "-I{build.matter_sdk_path}/src" "-I{build.matter_sdk_path}/src/include" "-I{build.matter_sdk_path}/src/lib" "-I{build.matter_sdk_path}/third_party/nlassert/repo/include" "-I{build.matter_sdk_path}/third_party/nlio/repo/include" "-I{build.matter_sdk_path}/zzz_generated/app-common" "-I{build.matter_sdk_path}/src/lib/address_resolve" "-I{build.matter_sdk_path}/src/app" "-I{build.matter_sdk_path}/zzz_generated/app-common/app-common/zap-generated/attributes" "-I{build.matter_sdk_path}/src/lib/dnssd" "-I{build.matter_sdk_path}/examples/platform/silabs/efr32" "-I{build.matter_sdk_path}/src/platform/silabs/efr32" "-I{build.matter_sdk_path}/src/include/platform" "-I{build.matter_sdk_path}/src/include/platform/internal" "-I{build.matter_sdk_path}/src/platform/logging" "-I{build.matter_sdk_path}/src/include/platform/internal/testing" "-I{build.matter_sdk_path}/src/platform/silabs" "-I{build.matter_sdk_path}/src/platform/OpenThread" "-I{build.matter_sdk_path}/src/platform/silabs/platformAbstraction" "-I{build.matter_sdk_path}/src/platform" "-I{build.matter_sdk_path}/src/platform/FreeRTOS" "-I{build.matter_sdk_path}/src/protocols/interaction_model" "-I{build.matter_sdk_path}/src/access/examples" "-I{build.matter_sdk_path}/src/access" "-I{build.matter_sdk_path}/src/lib/asn1" "-I{build.matter_sdk_path}/src/protocols/bdx" "-I{build.matter_sdk_path}/src/ble" "-I{build.matter_sdk_path}/src/app/server" "-I{build.matter_sdk_path}/src/controller" "-I{build.matter_sdk_path}/src/lib/core" "-I{build.matter_sdk_path}/src/crypto" "-I{build.matter_sdk_path}/src/app/reporting" "-I{build.matter_sdk_path}/src/app/MessageDef" "-I{build.matter_sdk_path}/src/protocols/echo" "-I{build.matter_sdk_path}/src/protocols/user_directed_commissioning" "-I{build.matter_sdk_path}/src/protocols" "-I{build.matter_sdk_path}/src/protocols/secure_channel" "-I{build.matter_sdk_path}/zzz_generated/app-common/app-common/zap-generated" "-I{build.matter_sdk_path}/src/credentials/examples" "-I{build.matter_sdk_path}/src/credentials/tests" "-I{build.matter_sdk_path}/src/credentials" "-I{build.matter_sdk_path}/src/credentials/attestation_verifier" "-I{build.matter_sdk_path}/src/inet" "-I{build.matter_sdk_path}/examples/providers" "-I{build.matter_sdk_path}/src/messaging" "-I{build.matter_sdk_path}/src/transport/raw" "-I{build.matter_sdk_path}/src/setup_payload" "-I{build.matter_sdk_path}/src/lib/support/logging" "-I{build.matter_sdk_path}/src/lib/support" "-I{build.matter_sdk_path}/src/lib/support/verhoeff" "-I{build.matter_sdk_path}/src/system" "-I{build.matter_sdk_path}/src/transport" "-I{build.matter_sdk_path}/src/app/clusters/basic-information" "-I{build.matter_sdk_path}/src/app/clusters/color-control-server" "-I{build.matter_sdk_path}/src/app/clusters/scenes-server" "-I{build.matter_sdk_path}/src/app/clusters/diagnostic-logs-server" "-I{build.matter_sdk_path}/src/app/clusters/door-lock-server" "-I{build.matter_sdk_path}/src/app/clusters/fan-control-server" "-I{build.matter_sdk_path}/src/app/clusters/general-commissioning-server" "-I{build.matter_sdk_path}/src/app/clusters/general-diagnostics-server" "-I{build.matter_sdk_path}/src/app/clusters/groups-server" "-I{build.matter_sdk_path}/src/app/icd" "-I{build.matter_sdk_path}/src/app/clusters/identify-server" "-I{build.matter_sdk_path}/slc/inc" "-I{build.matter_sdk_path}/src/app/clusters/level-control" "-I{build.matter_sdk_path}/src/app/clusters/network-commissioning" "-I{build.matter_sdk_path}/src/app/clusters/occupancy-sensor-server" "-I{build.matter_sdk_path}/src/app/clusters/on-off-server" "-I{build.matter_sdk_path}/src/app/clusters/ota-requestor" "-I{build.matter_sdk_path}/examples/platform/silabs/provision" "-I{build.matter_sdk_path}/third_party/silabs/gecko_sdk/util/third_party/segger/systemview/SEGGER" "-I{build.matter_sdk_path}/src/app/clusters/software-diagnostics-server" "-I{build.matter_sdk_path}/src/app/clusters/switch-server" "-I{build.matter_sdk_path}/src/app/clusters/window-covering-server" "-I{build.matter_sdk_path}/src/tracing" "-I{build.gsdk_path}/platform/Device/SiliconLabs/EFR32MG24/Include" "-I{build.gsdk_path}/app/common/util/app_assert" "-I{build.gsdk_path}/app/common/util/app_log" "-I{build.gsdk_path}/platform/common/inc" "-I{build.gsdk_path}/protocol/bluetooth/bgcommon/inc" "-I{build.gsdk_path}/protocol/bluetooth/inc" "-I{build.gsdk_path}/protocol/bluetooth/bgstack/ll/inc" "-I{build.gsdk_path}/hardware/board/inc" "-I{build.gsdk_path}/platform/bootloader" "-I{build.gsdk_path}/platform/bootloader/api" "-I{build.gsdk_path}/platform/CMSIS/Core/Include" "-I{build.gsdk_path}/platform/CMSIS/RTOS2/Include" "-I{build.gsdk_path}/hardware/driver/configuration_over_swo/inc" "-I{build.gsdk_path}/platform/driver/debug/inc" "-I{build.gsdk_path}/platform/service/device_init/inc" "-I{build.gsdk_path}/platform/emdrv/dmadrv/inc" "-I{build.gsdk_path}/platform/emdrv/common/inc" "-I{build.gsdk_path}/platform/emlib/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/fem_util" "-I{build.gsdk_path}/util/third_party/freertos/cmsis/Include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/include" "-I{build.gsdk_path}/util/third_party/freertos/kernel/portable/GCC/ARM_CM33_NTZ/non_secure" "-I{build.gsdk_path}/platform/emdrv/gpiointerrupt/inc" "-I{build.gsdk_path}/platform/service/hfxo_manager/inc" "-I{build.gsdk_path}/platform/driver/i2cspm/inc" "-I{build.gsdk_path}/platform/service/iostream/inc" "-I{build.gsdk_path}/platform/driver/leddrv/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/config/preset" "-I{build.gsdk_path}/platform/security/sl_component/sl_mbedtls_support/inc" "-I{build.gsdk_path}/util/third_party/mbedtls/include" "-I{build.gsdk_path}/util/third_party/mbedtls/library" "-I{build.gsdk_path}/platform/service/mpu/inc" "-I{build.gsdk_path}/hardware/driver/mx25_flash_shutdown/inc/sl_mx25_flash_shutdown_usart" "-I{build.gsdk_path}/platform/emdrv/nvm3/inc" "-I{build.gsdk_path}/util/third_party/openthread/include" "-I{build.gsdk_path}/util/third_party/openthread/include/openthread" "-I{build.gsdk_path}/util/third_party/openthread/src/core" "-I{build.gsdk_path}/util/third_party/openthread/src/lib" "-I{build.gsdk_path}/util/third_party/openthread/third_party/tcplp" "-I{build.gsdk_path}/util/third_party/openthread/examples/platforms" "-I{build.gsdk_path}/util/third_party/openthread/examples/platforms/utils" "-I{build.gsdk_path}/protocol/openthread/platform-abstraction/efr32" "-I{build.gsdk_path}/protocol/openthread/platform-abstraction/include" "-I{build.gsdk_path}/platform/peripheral/inc" "-I{build.gsdk_path}/platform/service/power_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_psa_driver/inc" "-I{build.gsdk_path}/platform/driver/pwm/inc" "-I{build.gsdk_path}/platform/radio/rail_lib/common" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ble" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/ieee802154" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/wmbus" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/zwave" "-I{build.gsdk_path}/platform/radio/rail_lib/chip/efr32/efr32xg2x" "-I{build.gsdk_path}/platform/radio/rail_lib/protocol/sidewalk" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_built_in_phys/efr32xg24" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/pa-conversions/efr32xg24" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_power_manager_init" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_pti" "-I{build.gsdk_path}/platform/radio/rail_lib/plugin/rail_util_rssi" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/inc" "-I{build.gsdk_path}/platform/security/sl_component/se_manager/src" "-I{build.gsdk_path}/util/plugin/security_manager" "-I{build.gsdk_path}/util/silicon_labs/silabs_core/memory_manager" "-I{build.gsdk_path}/platform/common/toolchain/inc" "-I{build.gsdk_path}/platform/service/system/inc" "-I{build.gsdk_path}/platform/service/sleeptimer/inc" "-I{build.gsdk_path}/platform/security/sl_component/sl_protocol_crypto/src" "-I{build.gsdk_path}/platform/emdrv/spidrv/inc" "-I{build.gsdk_path}/platform/service/udelay/inc"

xg24devkit.menu.protocol_stack.none.build.precompiled_libs=

xg24devkit.menu.protocol_stack.ble.build.precompiled_libs="{build.variant.path}/ble/libbgcommon_efr32xg24_gcc_release.a" "{build.variant.path}/ble/libbluetooth_controller_efr32xg24_gcc_release.a" "{build.variant.path}/ble/libbluetooth_host_efr32xg24_gcc_release.a" "{build.variant.path}/ble/libnvm3_CM33_gcc.a" "{build.variant.path}/ble/librail_efr32xg24_gcc_release.a"

xg24devkit.menu.protocol_stack.matter.build.precompiled_libs="{build.variant.path}/matter/libbgcommon_efr32xg24_gcc_release.a" "{build.variant.path}/matter/libbluetooth_controller_efr32xg24_gcc_release.a" "{build.variant.path}/matter/libbluetooth_host_efr32xg24_gcc_release.a" "{build.variant.path}/matter/libnvm3_CM33_gcc.a" "{build.variant.path}/matter/librail_multiprotocol_efr32xg24_gcc_release.a" "{build.variant.path}/matter/libsl_openthread_efr32mg2x_gcc.a"

