SiliconLabs/arduino/boards.txt
xg27devkit.name=Silicon Labs xG27 Dev Kit
xg27devkit.menu.protocol_stack.ble=BLE
xg27devkit.menu.protocol_stack.none=None
xg27devkit.upload.tool=simplicitycommander
xg27devkit.upload.tool.default=simplicitycommander
xg27devkit.upload.target=xg27devkit
xg27devkit.upload.maximum_data_size=65536
xg27devkit.upload.maximum_size=786432
xg27devkit.upload.protocol=jlink
xg27devkit.upload.setup_command=
xg27devkit.upload.use_1200bps_touch=false
xg27devkit.upload.wait_for_upload_port=false
xg27devkit.upload.native_usb=false
xg27devkit.bootloader.tool=simplicitycommander
xg27devkit.bootloader.tool.default=simplicitycommander
xg27devkit.bootloader.file=xg27-dev-kit-bootloader-storage-internal-single-512k.hex
xg27devkit.build.mcu=cortex-m33
xg27devkit.build.f_cpu=76800000
xg27devkit.build.board=SILABS_XG27DEVKIT
xg27devkit.build.core=silabs
xg27devkit.build.variant=xg27devkit
xg27devkit.build.variant_system_lib=
xg27devkit.debug.server=jlink

xg27devkit.build.gsdk_path=
xg27devkit.menu.protocol_stack.ble.build.precompiled_gsdk="{build.variant.path}/ble/gsdk.a"
xg27devkit.menu.protocol_stack.none.build.precompiled_gsdk="{build.variant.path}/noradio/gsdk.a"

xg27devkit.menu.protocol_stack.ble.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble/include"

xg27devkit.menu.protocol_stack.none.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/noradio/include"

xg27devkit.menu.protocol_stack.none.build.precompiled_libs=

xg27devkit.menu.protocol_stack.ble.build.precompiled_libs="{build.variant.path}/ble/libbgcommon_efr32xg27_gcc_release.a" "{build.variant.path}/ble/libbluetooth_controller_efr32xg27_gcc_release.a" "{build.variant.path}/ble/libbluetooth_host_efr32xg27_gcc_release.a" "{build.variant.path}/ble/libnvm3_CM33_gcc.a" "{build.variant.path}/ble/librail_efr32xg27_gcc_release.a"

xg27devkit.build.board_specific_macros='-DNUM_LEDS=1' '-DNUM_BTN=1' '-DNUM_HW_SERIAL=2' '-DNUM_HW_SPI=1' '-DNUM_HW_I2C=1' '-DARDUINO_MAIN_TASK_STACK_SIZE=2048'

xg27devkit.menu.protocol_stack.none.build.extra_flags={build.board_specific_macros} '-DEFR32BG27C140F768IM40=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DHFXO_FREQ=38400000' '-DSL_BOARD_NAME="BRD2602A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>'

xg27devkit.menu.protocol_stack.ble.build.extra_flags={build.board_specific_macros} '-DEFR32BG27C140F768IM40=1' '-DSL_APP_PROPERTIES=1' '-DHARDWARE_BOARD_DEFAULT_RF_BAND_2400=1' '-DHARDWARE_BOARD_SUPPORTS_1_RF_BAND=1' '-DHARDWARE_BOARD_SUPPORTS_RF_BAND_2400=1' '-DSL_BOARD_NAME="BRD2602A"' '-DSL_BOARD_REV="A02"' '-DconfigNUM_SDK_THREAD_LOCAL_STORAGE_POINTERS=2' '-DSL_COMPONENT_CATALOG_PRESENT=1' '-DMBEDTLS_CONFIG_FILE=<sl_mbedtls_config.h>' '-DMBEDTLS_PSA_CRYPTO_CONFIG_FILE=<psa_crypto_config.h>' '-DSL_RAIL_LIB_MULTIPROTOCOL_SUPPORT=0' '-DSL_RAIL_UTIL_PA_CONFIG_HEADER=<sl_rail_util_pa_config.h>' '-DSLI_RADIOAES_REQUIRES_MASKING=1'

xg27devkit.build.float_flags=

xg27devkit.build.s_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -imacros sl_gcc_preinclude.h -x assembler-with-cpp -c -g

xg27devkit.build.c_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c99 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

xg27devkit.build.cpp_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard -c -g {compiler.warning_flags} {build.float_flags} -std=c++11 -Wall -Wextra -fdata-sections -ffunction-sections -fomit-frame-pointer -imacros sl_gcc_preinclude.h -mcmse --specs=nano.specs -g

xg27devkit.build.ld_flags=-mcpu={build.mcu} -mthumb -mfpu=fpv5-sp-d16 -mfloat-abi=hard --specs=nano.specs -Xlinker -Map {compiler.mapfile_path} -Wl,--gc-sections

xg27devkit.build.ld_libs=-lstdc++ -lgcc -lc -lm -lnosys -lsupc++

xg27devkit.menu.protocol_stack.none.build.ldscript={build.variant.path}/noradio/linkerfile.ld
xg27devkit.menu.protocol_stack.ble.build.ldscript={build.variant.path}/ble/linkerfile.ld


##################################
# Silicon Labs BGM220 Explorer Kit
# OPN: brd4314a
##################################

bgm220explorerkit.name=Silicon Labs BGM220 Explorer Kit
bgm220explorerkit.menu.protocol_stack.ble=BLE
bgm220explorerkit.menu.protocol_stack.none=None
bgm220explorerkit.upload.tool=simplicitycommander
bgm220explorerkit.upload.tool.default=simplicitycommander
bgm220explorerkit.upload.target=bgm220explorerkit
bgm220explorerkit.upload.maximum_data_size=32768
bgm220explorerkit.upload.maximum_size=524288
bgm220explorerkit.upload.protocol=jlink
bgm220explorerkit.upload.setup_command=
bgm220explorerkit.upload.use_1200bps_touch=false
bgm220explorerkit.upload.wait_for_upload_port=false
bgm220explorerkit.upload.native_usb=false
bgm220explorerkit.bootloader.tool=simplicitycommander
bgm220explorerkit.bootloader.tool.default=simplicitycommander
bgm220explorerkit.bootloader.file=bgm220-explorer-kit-bootloader-storage-internal-single-512k.hex
bgm220explorerkit.build.mcu=cortex-m33
bgm220explorerkit.build.f_cpu=78000000
bgm220explorerkit.build.board=SILABS_BGM220EXPLORERKIT
bgm220explorerkit.build.core=silabs
bgm220explorerkit.build.variant=bgm220explorerkit
bgm220explorerkit.build.variant_system_lib=
bgm220explorerkit.debug.server=jlink

bgm220explorerkit.build.gsdk_path=
bgm220explorerkit.menu.protocol_stack.ble.build.precompiled_gsdk="{build.variant.path}/ble/gsdk.a"
bgm220explorerkit.menu.protocol_stack.none.build.precompiled_gsdk="{build.variant.path}/noradio/gsdk.a"

bgm220explorerkit.menu.protocol_stack.ble.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/ble/include"
bgm220explorerkit.menu.protocol_stack.none.build.include_list="-I{build.variant.path}" "-I{build.variant.path}/noradio/include"

bgm220explorerkit.menu.protocol_stack.ble.build.precompiled_libs="{build.variant.path}/ble/libbgcommon_efr32xg22_gcc_release.a" "{build.variant.path}/ble/libbluetooth_controller_efr32xg22_gcc_release.a" "{build.variant.path}/ble/libbluetooth_host_efr32xg22_gcc_release.a" "{build.variant.path}/ble/libnvm3_CM33_gcc.a" "{build.variant.path}/ble/librail_config_bgm220pc22hna_gcc.a" "{build.variant.path}/ble/librail_module_efr32xg22_gcc_release.a"

bgm220explorerkit.menu.protocol_stack.none.build.precompiled_libs=

